[Repository]
Name=Company 3ds Max Bundle Plugins

[Plugin.jx-qachar]
Id=jx-qachar
Name=角色模型规范检查
Version=1.0.1
Type=bundle
Package=packages/JX_QAChar_v1.0.1.bundle.zip
BundleName=JX_QAChar.bundle
UpgradeCode={4476B423-0AF3-4882-A706-932413406477}
LegacyIds=jx-qachar-v1-0-0
Sha256=789ee1dbada60965388082a60dbe613c1eb8350d179717258353b5742dfbbd38
MacroCategory=JXTools
MacroName=JX_QAChar
Author=TA
MinMaxVersion=2020
MaxMaxVersion=2027
Log=检查角色模型常见规范问题，并提供集中结果界面。

[Plugin.jxtools-multibillboardsetter]
Id=jxtools-multibillboardsetter
Name=珍珠导出插件
Version=1.0.1
Type=bundle
Package=packages/JXTools_MultiBillboardSetter_v1.0.1.bundle.zip
BundleName=JXTools_MultiBillboardSetter.bundle
UpgradeCode={04936407-5D69-4609-B4F2-ECBA95C7553D}
LegacyIds=jxtools-multibillboardsetter-v1-0-0
Sha256=28a5b45e264d0e9ab80732004404725a337eeaae725f40822c8a6d1904154f5c
MacroCategory=JXTools
MacroName=JXTools_MultiBillboardSetter
Author=PXJ
MinMaxVersion=2020
MaxMaxVersion=2027
Log=珍珠处理与 FBX 导出，支持普通导出和 Unity 统一轴向导出。

[Plugin.reset-skinned-xform]
Id=reset-skinned-xform
Name=蒙皮模型变换修复
Version=1.2.1
Type=bundle
Package=packages/ResetSkinnedXForm_v1.2.1.bundle.zip
BundleName=ResetSkinnedXForm.bundle
UpgradeCode={710B57DA-99C5-430B-8099-3BC5B7626E88}
LegacyIds=resetskinnedxform
Sha256=8a24bebbcb5530ac5a31c8ae0298327d02a1ae4011fd74aa8d70cc758ae7cde8
MacroCategory=Rigging Tools
MacroName=ResetSkinnedXForm
Author=PXJ
MinMaxVersion=2020
MaxMaxVersion=2027
Log=安全修复蒙皮模型的负变换与面朝向，处理前会检查 Skin、层级、动画和拓扑风险。

[Plugin.jxtools-pearlcurvecards]
Id=jxtools-pearlcurvecards
Name=珍珠曲线面片工具
Version=2.0.0
Type=bundle
Package=packages/JXTools_PearlCurveCards_v2.0.0.bundle.zip
BundleName=JXTools_PearlCurveCards.bundle
UpgradeCode={49EA0280-B23E-4EEB-9529-37B388665B5D}
LegacyIds=jxtools-pearlcurvecards-v2-0-0
Sha256=74f6a35a4aa7134cdb1b13200292ae698635d1b0b48f3afd16474795a3d3e448
MacroCategory=JXTools
MacroName=JXTools_PearlCurveCards
Author=龙哥
MinMaxVersion=2020
MaxMaxVersion=2027
Log=沿曲线生成珍珠、面片或代理模型，并提供数量、尺寸、循环、UV 和实时刷新控制。

[Plugin.accessory-slot-matcher]
Id=accessory-slot-matcher
Name=挂件匹配插槽坐标
Version=1.5.0
Type=bundle
Package=packages/AccessorySlotMatcher_v1.5.0.bundle.zip
BundleName=AccessorySlotMatcher.bundle
UpgradeCode={E2AB5D9B-1419-4866-9738-2FDC5610672A}
Sha256=564533f466b3d3930d579c16b74e8310c7dcc2387e50735ef6b2efefc92b06de
MacroCategory=JXTools
MacroName=AccessorySlotMatcher
Author=毛老师
MinMaxVersion=2020
MaxMaxVersion=2027
Log=将所选挂件模型的轴心匹配到 F1、F2、M2 体型的耳饰、面具、头饰、项链、胸前项链或背挂插槽坐标。

[Plugin.jxtools-multibillboardsetter-test]
Id=jxtools-multibillboardsetter-test
Name=珍珠导出插件测试
Version=1.0.2
Type=bundle
Package=packages/JXTools_MultiBillboardSetter_Test_v1.0.2.bundle.zip
BundleName=JXTools_MultiBillboardSetter_Test.bundle
UpgradeCode={275E8710-3929-4574-8C0F-8DECFA9BECCE}
Sha256=62cbe9663edbab5a6427f67257413ebc8505de61c783a8fa0acb117811b48a1d
MacroCategory=JXTools
MacroName=JXTools_MultiBillboardSetter_Test
Author=PXJ
MinMaxVersion=2020
MaxMaxVersion=2027
Log=珍珠处理与 FBX 导出测试版，支持普通导出和 Unity 统一轴向导出。

[Plugin.max-uv-angle-auto-smooth]
Id=max-uv-angle-auto-smooth
Name=UV角度自动平滑组
Version=1.0.0
Type=bundle
Package=packages/MaxUVAngleAutoSmooth_v1.0.0.bundle.zip
BundleName=MaxUVAngleAutoSmooth.bundle
UpgradeCode={5F3B7A4D-DBB6-4D8D-BF7D-8B2FBC4D4E86}
Sha256=5304491446aaa7e5913c425cabb1b7a2ca4abc8c201ec70b101878e165e0badc
MacroCategory=UV Tools
MacroName=MaxUVAngleAutoSmooth_Rebuild
Author=宝爷
MinMaxVersion=2020
MaxMaxVersion=2027
Log=根据 UV 接缝与折角阈值重建平滑组，并支持分裂边预览、UV 岛和同平滑组面选择。

[Plugin.skin-processing-tool]
Id=skin-processing-tool
Name=蒙皮处理工具
Version=1.1.1
Type=bundle
Package=packages/SkinProcessingTool_v1.1.1.bundle.zip
BundleName=SkinProcessingTool.bundle
UpgradeCode={32E5F919-8C54-491B-BA2D-65F2BCC9C481}
Sha256=d922f7e73f8e44a22e1c27fa886829226c394dbcd47685c97e0434d07d93aeab
MacroCategory=Rigging Tools
MacroName=SkinProcessingTool
Author=子墨
MinMaxVersion=2020
MaxMaxVersion=2027
Log=蒙皮模型分离、合并及任意面处理。
